In [14]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [15]:
df = df.rename(columns={'First Name' : 'first_name','Age': 'age'})
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [16]:
print(df.head(3))

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [17]:
print(df.age.mean())

32.5

In [18]:
print(df[['first_name', 'age']])

  first_name  age
0      Alice   25
1        Bob   30
2    Charlie   35
3      David   40

In [22]:
import numpy as np
df['salary'] = np.random.randint(100000, 200000, size=len(df))
df

  first_name  age           City  salary
0      Alice   25       New York  155117
1        Bob   30  San Francisco  170538
2    Charlie   35    Los Angeles  161214
3      David   40        Chicago  173328

In [ ]:
df.describe(include='all')

       first_name        age      City         salary
count           4   4.000000         4       4.000000
unique          4        NaN         4            NaN
top         Alice        NaN  New York            NaN
freq            1        NaN         1            NaN
mean          NaN  32.500000       NaN  165049.250000
std           NaN   6.454972       NaN    8406.799049
min           NaN  25.000000       NaN  155117.000000
25%           NaN  28.750000       NaN  159689.750000
50%           NaN  32.500000       NaN  165876.000000
75%           NaN  36.250000       NaN  171235.500000
max           NaN  40.000000       NaN  173328.000000

In [31]:
data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}

# Create the DataFrame
sales_and_expenses = pd.DataFrame(data)
se = sales_and_expenses
mx = se[['Sales', 'Expenses']].max()
mn = se[['Sales', 'Expenses']].min()
avg = se[['Sales', 'Expenses']].mean()
print(mx,mn, avg, sep='\n')

Sales       8000
Expenses    4500
dtype: int64
Sales       5000
Expenses    3000
dtype: int64
Sales       6625.0
Expenses    3750.0
dtype: float64

In [42]:
data = {'Category': ['Rent', 'Utilities', "Groceries", 'Entertainment'],
        'January': [1200, 200, 300, 150],
        'February': [1300,220, 320, 160],
        'March': [1400,240, 330, 170],
        'April': [1500, 250, 350, 180]
    
}
expenses = pd.DataFrame(data)
expenses.set_index('Category')

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [43]:
maxi = expenses[['January', 'February', 'March', 'April']].max()
mini = expenses[['January', 'February', 'March', 'April']].min()
avi = expenses[['January', 'February', 'March', 'April']].mean()
print(maxi, mini, avi, sep='\n')

January     1200
February    1300
March       1400
April       1500
dtype: int64
January     150
February    160
March       170
April       180
dtype: int64
January     462.5
February    500.0
March       535.0
April       570.0
dtype: float64

In [ ]:
df[]